Repository: datpusheen/MiniWatts
Catalog: MiniWatts/Localizable.xcstrings
Source language: en
Languages: vi, zh_hans

source: %@ above the best this charger has recorded. Same charger, so that difference is the cable and the plugs — not the adapter.
vi: Cao hơn %@ so với mức tốt nhất từng ghi nhận trên bộ sạc này. Vì dùng cùng bộ sạc, chênh lệch này đến từ cáp và đầu nối, không phải bộ sạc.
zh_hans: 比该充电器的最好记录高 %@。充电器相同，所以这个差值来自线缆和插头，不是适配器。

source: %@ at the port
vi: %@ tại cổng
zh_hans: 端口实测 %@

source: %lld sessions
vi: %lld phiên sạc
zh_hans: %lld 次充电

source: at the current draw
vi: ở mức dòng điện hiện tại
zh_hans: 按当前取电

source: Cable and connection
vi: Cáp và kết nối
zh_hans: 线缆与连接

source: Cable comparison
vi: So sánh cáp
zh_hans: 线缆对比

source: Either way this is the whole path — the charger's own regulation, the cable and both plugs — not the cable alone, so it reads best as a comparison between cables on the same charger.
vi: Cả hai cách đều đo toàn bộ đường sạc, gồm khả năng ổn áp của bộ sạc, cáp và hai đầu nối, chứ không chỉ riêng cáp. Vì vậy, kết quả phù hợp nhất để so sánh các cáp dùng trên cùng một bộ sạc.
zh_hans: 两种算法给出的都是整条通路——充电器自身的稳压、线缆和两端插头——而不是线缆本身，所以它最适合用来在同一个充电器上横向比较不同的线。

source: Fahrenheit
vi: Độ F
zh_hans: 华氏度

source: Fitted over %@ of current swing, with %@ of it on the line.
vi: Khớp trên khoảng biến thiên dòng điện %@, với %@ mức biến thiên được giải thích bởi đường hồi quy.
zh_hans: 在 %@ 的电流变化范围内拟合，其中 %@ 落在这条直线上。

source: fitted over the whole contract
vi: khớp trên toàn bộ giai đoạn dùng cùng cấu hình sạc
zh_hans: 在整段合约上拟合

source: from one sample
vi: từ một mẫu đo
zh_hans: 单次采样

source: From one sample, against the negotiated %@. That figure is a ceiling rather than a measurement, so read this as an order of magnitude. Once the current moves — the taper past 80%, thermal throttling, the phone's own load — it is replaced by a fit that needs no reference at all.
vi: Dựa trên một mẫu đo, so với mức %@ đã thương lượng. Đây là giới hạn tối đa chứ không phải số đo, nên chỉ dùng để ước lượng độ lớn. Khi dòng điện thay đổi do giảm dòng sau 80%, giới hạn nhiệt hoặc tải của điện thoại, kết quả sẽ được thay bằng phép khớp không cần giá trị tham chiếu.
zh_hans: 单次采样，以协商出的 %@ 为参考。那个值是天花板而不是测量值，所以只能当数量级看。一旦电流动起来——80% 之后的涓流、热降频、手机自身的负载——它就会被一个完全不需要参考值的拟合结果取代。

source: Get ${metric}
vi: Lấy ${metric}
zh_hans: 获取${metric}

source: Get ${metric} in ${unit}
vi: Lấy ${metric} theo ${unit}
zh_hans: 获取${metric}（${unit}）

source: Get Reading
vi: Lấy số đo
zh_hans: 获取读数

source: High for a charging path. A thinner or longer cable, a worn plug or a loose fit all look like this. Trying another cable on the same charger is the way to tell which.
vi: Cao đối với đường sạc. Cáp mảnh hoặc dài, đầu nối bị mòn hay kết nối lỏng đều có thể gây ra tình trạng này. Hãy thử cáp khác trên cùng bộ sạc để xác định nguyên nhân.
zh_hans: 对充电通路来说偏高。线更细、更长，插头磨损，或接触松动，看起来都是这样。在同一个充电器上换一根线，才能分清是哪一种。

source: Lost in the path
vi: Tổn hao trên đường sạc
zh_hans: 通路损耗

source: Low. Nothing in this connection is holding the charge back.
vi: Thấp. Kết nối này không cản trở quá trình sạc.
zh_hans: 低。这条连接没有拖慢充电。

source: of the current on offer
vi: của dòng điện được cung cấp
zh_hans: 占可用电流

source: Ordinary for a long or thin cable. It costs a little power as heat, and at these currents it is unlikely to change how fast the phone charges.
vi: Bình thường với cáp dài hoặc mảnh. Một ít công suất bị mất dưới dạng nhiệt, nhưng ở mức dòng điện này thường không ảnh hưởng đến tốc độ sạc.
zh_hans: 对较长或较细的线缆来说很常见。会有少量功率变成热，在这样的电流下不太会影响充电速度。

source: Path resistance
vi: Điện trở đường sạc
zh_hans: 通路电阻

source: Reading
vi: Số đo
zh_hans: 读数

source: Reads one value from the phone's sensors at the moment the action runs. When a sensor does not answer, the action returns no value — never 0, and never an older reading — so a shortcut can tell the difference.
vi: Đọc một giá trị từ cảm biến của điện thoại ngay khi tác vụ chạy. Nếu cảm biến không phản hồi, tác vụ không trả về giá trị nào, kể cả 0 hay số đo cũ, để phím tắt có thể phân biệt tình huống này.
zh_hans: 在动作运行的那一刻从手机传感器读取一个值。传感器没有应答时，动作返回“无值”——不会返回 0，也不会返回之前的读数——这样快捷指令能分辨出来。

source: Taking
vi: Đang nhận
zh_hans: 取电比例

source: Temperature unit
vi: Đơn vị nhiệt độ
zh_hans: 温度单位

source: The lowest path resistance recorded on this charger. Whatever was plugged in here is as good as it has seen.
vi: Điện trở đường sạc thấp nhất từng ghi nhận trên bộ sạc này. Kết nối hiện tại đạt mức tốt nhất từng đo được.
zh_hans: 这是该充电器上记录到的最低通路电阻。这次用的线和插法，已经是它见过最好的。

source: The rail is collapsing under load. The phone is taking well under what the charger offered, and the voltage at the port is far below what was negotiated — the current is being held down to stop it falling further. Try another cable on this charger: if the drop shrinks, it was the cable.
vi: Điện áp đường nguồn sụt mạnh khi có tải. Điện thoại nhận dòng thấp hơn nhiều so với mức bộ sạc cung cấp, còn điện áp tại cổng thấp hơn nhiều so với mức đã thương lượng. Dòng điện đang bị giới hạn để điện áp không giảm thêm. Hãy thử cáp khác trên cùng bộ sạc: nếu sụt áp giảm, nguyên nhân là cáp.
zh_hans: 供电轨在负载下塌陷。手机取的电远低于充电器给出的额度，端口电压也远低于协商值——电流正被压着，以免电压继续往下掉。在这个充电器上换一根线试试：压降变小，就是线的问题。

source: The voltage at the port has collapsed well below what was negotiated, and the phone is holding the current down to keep it up. That is the cable or the plugs, not the charger.
vi: Điện áp tại cổng đã sụt thấp hơn nhiều so với mức đã thương lượng, và điện thoại đang giới hạn dòng để duy trì điện áp. Nguyên nhân là cáp hoặc đầu nối, không phải bộ sạc.
zh_hans: 端口电压已经塌到远低于协商值，手机正压着电流以维持电压。问题出在线缆或插头，不在充电器。

source: Unit
vi: Đơn vị
zh_hans: 单位

source: Voltage drop
vi: Sụt áp
zh_hans: 电压损失

source: Waiting for the phone to draw enough to measure a drop. Below about 150 mA there is nothing to divide.
vi: Đang chờ điện thoại nhận đủ dòng để đo sụt áp. Dưới khoảng 150 mA, chưa đủ dữ liệu để tính.
zh_hans: 等待手机取电到足以测出压降。低于约 150 mA 就没有可除的东西了。

source: Wireless charging has no cable and no input-current sensor, so there is nothing to measure.
vi: Sạc không dây không có cáp và cảm biến dòng đầu vào, nên không có gì để đo.
zh_hans: 无线充电没有线缆，也没有输入电流传感器，无从测量。

# %@ for %@
source: %1$@ for %2$@
vi: %@ trong %@
zh_hans: %1$@ 已持续 %2$@

source: %@ hot
vi: %@ quá nóng
zh_hans: %@ 发热

source: %@ W in
vi: %@ W đầu vào
zh_hans: %@ W 输入

source: %@ W to cell
vi: %@ W vào pin
zh_hans: %@ W 充入电芯

source: %lld samples
vi: %lld mẫu đo
zh_hans: %lld 个样本

source: %lld sensors
vi: %lld cảm biến
zh_hans: %lld 个传感器

source: %lld%% of adapter
vi: %lld%% công suất bộ sạc
zh_hans: 占适配器 %lld%%

source: A charge session survives the app being backgrounded: it ends when you unplug, not when you switch away. Any stretch the app missed is left out of the totals rather than estimated, and the session says how much of itself was actually measured.
vi: Phiên sạc vẫn tiếp tục khi ứng dụng chạy nền: phiên kết thúc khi bạn rút sạc, không phải khi chuyển sang ứng dụng khác. Khoảng thời gian ứng dụng không đo được sẽ bị loại khỏi tổng thay vì ước tính, và phiên sạc cho biết thời lượng thực sự được đo.
zh_hans: 切到后台不会结束一次充电记录：记录在拔掉充电器时才结束，而不是在你切走时。应用没看到的那段时间会从总量中排除，而不是估算补上；每条记录都会注明其中有多少是真正测到的。

source: A session starts when you plug in and is saved when you unplug. Energy is integrated from the live sensors, so keep MiniWatts in the foreground for the totals to cover the whole charge.
vi: Phiên sạc bắt đầu khi cắm sạc và được lưu khi rút sạc. Năng lượng được tính tích lũy từ cảm biến trực tiếp, nên hãy giữ MiniWatts trên màn hình để tổng số liệu bao quát toàn bộ phiên sạc.
zh_hans: 插入充电器时开始记录会话，拔出时自动保存。电量数据由实时传感器积分计算得出，因此请将 MiniWatts 保持在前台运行，以确保完整记录整个充电过程。

source: About
vi: Giới thiệu
zh_hans: 关于

source: Above 80% the charger tapers to constant-voltage, so low draw here is normal battery chemistry, not a weak charger.
vi: Trên 80%, quá trình sạc chuyển sang điện áp không đổi và giảm dòng. Công suất thấp ở giai đoạn này là đặc tính hóa học bình thường của pin, không phải do bộ sạc yếu.
zh_hans: 超过 80% 后充电转入恒压涓流阶段，此时功率偏低是正常的电池特性，不是充电器不行。

source: Accessories
vi: Phụ kiện
zh_hans: 配件

source: Accessory battery levels aren't available on this version of iOS.
vi: Phiên bản iOS này không cung cấp mức pin của phụ kiện.
zh_hans: 此 iOS 版本不支持读取配件电量。

source: Adapter
vi: Bộ sạc
zh_hans: 适配器

source: Adapter utilisation
vi: Mức sử dụng bộ sạc
zh_hans: 适配器利用率

source: Advertised profiles
vi: Cấu hình sạc được công bố
zh_hans: 广播供电规格

source: All sessions
vi: Tất cả phiên sạc
zh_hans: 所有会话

source: available
vi: khả dụng
zh_hans: 可用

source: Average in
vi: Đầu vào trung bình
zh_hans: 平均输入

source: Battery
vi: Pin
zh_hans: 电池

source: Battery °C
vi: Pin °C
zh_hans: 电池温度 °C

source: Battery cell
vi: Tế bào pin
zh_hans: 电芯

source: Battery energy
vi: Năng lượng pin
zh_hans: 电池能量

source: Battery health
vi: Tình trạng pin
zh_hans: 电池健康度

source: Battery pack voltage
vi: Điện áp bộ pin
zh_hans: 电池组电压

source: Battery rail
vi: Đường nguồn pin
zh_hans: 电池侧

source: Battery rail voltage
vi: Điện áp đường nguồn pin
zh_hans: 电池轨电压

source: BatteryCenter loaded and answered, but reported no connected devices. Its XPC to powerd is denied: the console shows _BCPowerSourceController "Failed to obtain power sources info".
vi: BatteryCenter đã tải và phản hồi nhưng không báo thiết bị nào được kết nối. Kết nối XPC tới powerd bị từ chối: bảng điều khiển hiển thị _BCPowerSourceController "Failed to obtain power sources info".
zh_hans: BatteryCenter 已加载并有响应，但未报告任何已连接设备。它对 powerd 的 XPC 被拒绝：控制台会出现 _BCPowerSourceController “Failed to obtain power sources info”。

source: BatteryCenter loaded but BCBatteryDeviceController is not in the runtime.
vi: BatteryCenter đã tải nhưng BCBatteryDeviceController không có trong môi trường thực thi.
zh_hans: BatteryCenter 已加载，但运行时中未找到 BCBatteryDeviceController。

source: BatteryCenter.framework did not load: %@
vi: Không tải được BatteryCenter.framework: %@
zh_hans: BatteryCenter.framework 加载失败：%@

source: BCBatteryDeviceController could not be created on this iOS version.
vi: Không thể tạo BCBatteryDeviceController trên phiên bản iOS này.
zh_hans: 在此 iOS 版本上无法创建 BCBatteryDeviceController。

source: BCBatteryDeviceController exposes no device list on this iOS version.
vi: BCBatteryDeviceController không cung cấp danh sách thiết bị trên phiên bản iOS này.
zh_hans: 在此 iOS 版本上，BCBatteryDeviceController 未提供设备列表。

source: Cancel
vi: Hủy
zh_hans: 取消

source: Case
vi: Hộp sạc
zh_hans: 充电盒

source: Cell current
vi: Dòng điện pin
zh_hans: 电芯电流

source: Cell temp
vi: Nhiệt độ pin
zh_hans: 电芯温度

source: Cell voltage
vi: Điện áp pin
zh_hans: 电芯电压

source: cell watts ÷ charger watts
vi: công suất vào pin ÷ công suất bộ sạc
zh_hans: 电芯功率 ÷ 充电器功率

source: Celsius
vi: Độ C
zh_hans: 摄氏度

source: Charge %
vi: Pin %
zh_hans: 电量 %

source: Charge curve
vi: Đường cong sạc
zh_hans: 充电曲线

source: Charge IC
vi: IC sạc
zh_hans: 充电芯片

source: Charge IC die
vi: Lõi IC sạc
zh_hans: 充电芯片核心温度

source: Charge IC junction
vi: Tiếp giáp IC sạc
zh_hans: 充电芯片结温

source: Charge level
vi: Mức pin
zh_hans: 电池电量

source: Charge power below the adapter's rating right now is expected: the limit is the system's, not the charger's.
vi: Công suất sạc hiện thấp hơn định mức bộ sạc là điều bình thường: giới hạn đến từ hệ thống, không phải bộ sạc.
zh_hans: 当前充电功率低于适配器额定功率属正常现象：此时的功率限制来自系统温控，而非充电器。

source: charging
vi: đang sạc
zh_hans: 充电中

source: Charging
vi: Đang sạc
zh_hans: 充电中

source: Charging is on hold, so almost nothing is being drawn. Optimized Battery Charging or a charge limit looks exactly like this.
vi: Quá trình sạc đang tạm dừng nên gần như không nhận công suất. Sạc pin được tối ưu hóa hoặc giới hạn sạc cũng có biểu hiện này.
zh_hans: 充电处于暂停状态，几乎不取电。优化电池充电或充电上限就是这个样子。

source: Charging on hold
vi: Sạc đang tạm dừng
zh_hans: 暂停充电

source: Charging wirelessly. The charge IC exposes the coil's voltage but no current to pair with it, so the power coming in cannot be measured — only what reaches the cell. The figure the charger reports about itself is a ceiling, not a reading, and does not move.
vi: Đang sạc không dây. IC sạc cung cấp điện áp cuộn dây nhưng không có dòng điện tương ứng, nên không thể đo công suất đầu vào, chỉ đo được công suất vào pin. Con số bộ sạc tự báo là giới hạn tối đa, không phải số đo, và không thay đổi.
zh_hans: 当前为无线充电。充电芯片仅提供了线圈电压，未提供对应电流，因此无法测量输入功率 —— 仅能测量充入电芯的功率。充电器自身报告的数值仅为功率上限而非实时读数，不会发生变化。

source: Chassis
vi: Thân máy
zh_hans: 机身

source: Critical
vi: Nguy cấp
zh_hans: 严重过热

source: Current into battery
vi: Dòng điện vào pin
zh_hans: 电池充电电流

source: Cycle count
vi: Số chu kỳ
zh_hans: 循环次数

source: Delete all
vi: Xóa tất cả
zh_hans: 全部删除

source: Delete all saved sessions?
vi: Xóa tất cả phiên sạc đã lưu?
zh_hans: 删除所有已保存的会话？

source: Delivered
vi: Đã cấp
zh_hans: 输入

source: Details
vi: Chi tiết
zh_hans: 详细信息

source: Device
vi: Thiết bị
zh_hans: 设备

source: Devices
vi: Thiết bị
zh_hans: 设备

source: Display
vi: Màn hình
zh_hans: 屏幕

source: Done
vi: Xong
zh_hans: 完成

source: Draw vs rating
vi: Công suất nhận so với định mức
zh_hans: 实际功率与额定功率

source: Drawing well under the adapter's rating. A thin cable, a shared port, or a profile the phone declined can all do this.
vi: Công suất nhận thấp hơn nhiều so với định mức bộ sạc. Nguyên nhân có thể là cáp mảnh, cổng dùng chung hoặc cấu hình sạc mà điện thoại không chấp nhận.
zh_hans: 远低于适配器的额定功率。线材太细、端口被分流，或手机拒绝了某个档位，都会这样。

source: drawn from battery
vi: lấy từ pin
zh_hans: 由电池供电

source: Earbuds + Case
vi: Tai nghe + Hộp sạc
zh_hans: 耳机 + 充电盒

source: Efficiency
vi: Hiệu suất
zh_hans: 转换效率

source: Elapsed
vi: Đã qua
zh_hans: 已用时间

source: empty in %@
vi: cạn sau %@
zh_hans: %@后耗尽

source: Ended
vi: Kết thúc
zh_hans: 结束

source: Energy
vi: Năng lượng
zh_hans: 能量

source: Fair
vi: Ấm
zh_hans: 轻度发热

source: Finishing charge
vi: Sắp sạc đầy
zh_hans: 即将充满

source: from battery (%-rate estimate)
vi: từ pin (ước tính theo tốc độ giảm %)
zh_hans: 来自电池（%-率估算）

source: from charger
vi: từ bộ sạc
zh_hans: 来自充电器

source: From charger
vi: Từ bộ sạc
zh_hans: 来自充电器

source: from MagSafe
vi: từ MagSafe
zh_hans: 来自 MagSafe

source: Full
vi: Đầy
zh_hans: 已充满

source: full in %@
vi: đầy sau %@
zh_hans: %@后充满

source: Gained
vi: Đã tăng
zh_hans: 增加电量

source: Handshake
vi: Thương lượng sạc
zh_hans: 握手信息

source: Heat map · schematic
vi: Bản đồ nhiệt · sơ đồ minh họa
zh_hans: 热力图 · 示意图

source: HID sensors
vi: Cảm biến HID
zh_hans: HID 传感器

source: History
vi: Lịch sử
zh_hans: 历史记录

source: Hottest
vi: Nóng nhất
zh_hans: 最高温度

source: Hottest sensor, last 3 minutes
vi: Cảm biến nóng nhất, 3 phút qua
zh_hans: 最高温传感器（最近 3 分钟）

source: idle
vi: chờ
zh_hans: 空闲

source: In progress
vi: Đang diễn ra
zh_hans: 进行中

source: inferred
vi: suy đoán
zh_hans: 推断

source: Internal
vi: Tích hợp
zh_hans: 内置

source: into battery
vi: vào pin
zh_hans: 进入电池

source: Into battery
vi: Vào pin
zh_hans: 进入电池

source: Into cell
vi: Vào tế bào pin
zh_hans: 充入电芯

source: IOKit reported a design capacity of %lld mAh on this system, so that value is being used instead.
vi: IOKit báo dung lượng thiết kế %lld mAh trên hệ thống này, nên giá trị đó được dùng thay thế.
zh_hans: IOKit 报告此系统的设计容量为 %lld mAh，因此将直接使用该数值。

source: Keep the screen on while charging
vi: Giữ màn hình sáng khi sạc
zh_hans: 充电时保持屏幕常亮

source: Last 3 minutes
vi: 3 phút qua
zh_hans: 最近 3 分钟

source: Left
vi: Trái
zh_hans: 左

source: Left + Right
vi: Trái + Phải
zh_hans: 左 + 右

source: Level and temperature
vi: Mức pin và nhiệt độ
zh_hans: 电量与温度

source: Live rails
vi: Đường nguồn trực tiếp
zh_hans: 实时供电轨

source: Lost
vi: Tổn hao
zh_hans: 损耗

source: Lost as heat
vi: Mất dưới dạng nhiệt
zh_hans: 发热损耗

source: low
vi: thấp
zh_hans: 低电量

source: Low Power
vi: Tiết kiệm pin
zh_hans: 低电量模式

source: Manufacturer
vi: Nhà sản xuất
zh_hans: 制造商

source: Measured for %1$@ of %2$@ — the app was backgrounded for the rest, and those gaps are excluded rather than estimated.
vi: Đã đo %@ trên tổng %@. Thời gian còn lại ứng dụng chạy nền nên bị loại khỏi tổng thay vì ước tính.
zh_hans: 在总计 %2$@ 中实际测量了 %1$@ —— 其余时间应用处于后台，该时间段直接排除未进行估算。

source: MiniWatts reads the phone's own power management sensors through private frameworks — IOKit, IOHIDEventSystemClient and BatteryCenter. Nothing leaves the device and nothing is written outside the app's own container.
vi: MiniWatts đọc cảm biến quản lý điện năng của điện thoại qua các framework riêng tư: IOKit, IOHIDEventSystemClient và BatteryCenter. Dữ liệu không rời khỏi thiết bị và không được ghi bên ngoài vùng lưu trữ riêng của ứng dụng.
zh_hans: MiniWatts 通过私有框架（IOKit、IOHIDEventSystemClient 和 BatteryCenter）读取手机自身的电源管理传感器。所有数据均保留在设备本地，且不会在应用自身的容器外写入任何内容。

source: Model
vi: Mẫu
zh_hans: 型号

source: Model identifier
vi: Mã định danh mẫu
zh_hans: 机型标识

source: Name
vi: Tên
zh_hans: 名称

source: Negotiated max
vi: Tối đa đã thương lượng
zh_hans: 协商档位

source: No cell temperature was recorded for this session.
vi: Không ghi nhận nhiệt độ pin cho phiên sạc này.
zh_hans: 本次记录没有电芯温度数据。

source: No finished charges yet
vi: Chưa có phiên sạc hoàn tất
zh_hans: 暂无已完成的充电记录

source: No HID power sensors were found. On the simulator this is expected — IOKit reads the Mac's battery and the phone's PMU sensors do not exist. Run on the device for real numbers.
vi: Không tìm thấy cảm biến công suất HID. Điều này bình thường trên trình mô phỏng: IOKit đọc pin của máy Mac và không có cảm biến PMU của điện thoại. Hãy chạy trên thiết bị để có số đo thực.
zh_hans: 未发现 HID 功率传感器。在模拟器上这是正常现象 —— IOKit 读取的是 Mac 的电池，手机的 PMU 传感器并不存在。请在真机上运行以获取真实数据。

source: no reading
vi: chưa có số đo
zh_hans: 无读数

source: No samples recorded.
vi: Chưa ghi nhận mẫu đo.
zh_hans: 未记录任何样本。

source: No temperature sensors were found. The simulator has none; on a device they appear as soon as the app has read the HID service list.
vi: Không tìm thấy cảm biến nhiệt độ. Trình mô phỏng không có các cảm biến này; trên thiết bị, chúng xuất hiện ngay khi ứng dụng đọc danh sách dịch vụ HID.
zh_hans: 未发现温度传感器。模拟器不提供温度传感器；在真机上，应用读取 HID 服务列表后即可显示。

source: No thermal limit on charge current.
vi: Dòng sạc không bị giới hạn do nhiệt.
zh_hans: 充电电流不受发热限制。

source: Nominal
vi: Bình thường
zh_hans: 正常

source: Not connected
vi: Chưa kết nối
zh_hans: 未连接

source: of
vi: trên

source: on battery
vi: dùng pin
zh_hans: 电池供电

source: On battery
vi: Dùng pin
zh_hans: 电池供电

source: Other sensors
vi: Cảm biến khác
zh_hans: 其他传感器

source: Overheated: charging is suspended until the phone cools.
vi: Quá nóng: sạc bị tạm dừng cho đến khi điện thoại nguội.
zh_hans: 设备过热：已暂停充电，直至手机冷却。

source: peak %@ W
vi: đỉnh %@ W
zh_hans: 峰值 %@ W

source: Peak cell temp
vi: Nhiệt độ pin cao nhất
zh_hans: 电芯温度峰值

source: Peak from charger
vi: Đỉnh từ bộ sạc
zh_hans: 充电器输入峰值

source: Peak into cell
vi: Đỉnh vào pin
zh_hans: 充入电芯峰值

source: Percent
vi: Phần trăm
zh_hans: 百分比

source: Plug in a charger to read its handshake. USB-PD adapters advertise a menu of voltage/current profiles; the phone picks one and this page shows which, alongside what is actually flowing.
vi: Cắm bộ sạc để đọc thông tin thương lượng. Bộ sạc USB-PD công bố các cấu hình điện áp và dòng điện; điện thoại chọn một cấu hình. Trang này hiển thị cấu hình đã chọn cùng số đo thực tế.
zh_hans: 接入充电器以读取其握手信息。USB-PD 适配器会广播包含电压与电流的供电规格列表；手机选择其中一个档位，此页面会显示所选档位以及当前实际的功率流动情况。

source: Plug in to start measuring. Energy is integrated from the live sensors while the app is open, and saved to History when you unplug.
vi: Cắm sạc để bắt đầu đo. Năng lượng được tính tích lũy từ cảm biến trực tiếp khi ứng dụng đang mở và được lưu vào Lịch sử khi rút sạc.
zh_hans: 接入充电器以开始测量。应用在前台运行时将从实时传感器积分计算电量，并在拔出时保存至历史记录。

source: Plugged in, not charging
vi: Đã cắm, chưa sạc
zh_hans: 已连接电源，未充电

source: Power
vi: Công suất
zh_hans: 功率

source: Power path
vi: Đường sạc
zh_hans: 供电路径

source: Power tier
vi: Mức công suất
zh_hans: 功率等级

source: Radios
vi: Kết nối vô tuyến
zh_hans: 射频模块

source: Rated
vi: Định mức
zh_hans: 额定

source: Recording
vi: Đang ghi
zh_hans: 记录

source: Right
vi: Phải
zh_hans: 右

source: Round trip
vi: Hiệu suất sạc
zh_hans: 综合效率

source: Samples
vi: Mẫu đo
zh_hans: 采样点

source: Sensors
vi: Cảm biến
zh_hans: 传感器

source: Sensors can only be read while MiniWatts is on screen, so a charge is only recorded for as long as the phone stays awake. With this on, the screen is held on — but only while a charger is connected, never on battery.
vi: Cảm biến chỉ đọc được khi MiniWatts hiển thị trên màn hình, nên phiên sạc chỉ được ghi khi điện thoại còn thức. Bật tùy chọn này để giữ màn hình sáng khi kết nối bộ sạc; tùy chọn không áp dụng khi dùng pin.
zh_hans: 只有 MiniWatts 在前台时才能读取传感器，所以一次充电只能记录到屏幕保持点亮为止。打开后会保持屏幕常亮——但仅限连接充电器时，用电池时绝不会。

source: Serial
vi: Số sê-ri
zh_hans: 序列号

source: Series
vi: Chuỗi dữ liệu
zh_hans: 系列

source: Serious
vi: Nóng
zh_hans: 严重发热

source: Settings
vi: Cài đặt
zh_hans: 设置

source: SoC dies
vi: Lõi SoC
zh_hans: SoC 芯片

source: Source
vi: Nguồn
zh_hans: 来源

source: Started
vi: Bắt đầu
zh_hans: 开始

source: Storage
vi: Bộ nhớ lưu trữ
zh_hans: 存储

source: Stored
vi: Đã tích trữ
zh_hans: 储存

source: stored in cell
vi: tích trữ trong pin
zh_hans: 充入电芯

source: System
vi: Hệ thống
zh_hans: 系统

source: system load + losses
vi: tải hệ thống + tổn hao
zh_hans: 系统负载 + 损耗

source: System thermal state
vi: Trạng thái nhiệt hệ thống
zh_hans: 系统发热状态

source: The temperatures are measured; the positions are not. iOS reports sensor names and values and no coordinates at all, so each zone is drawn at a fixed spot that follows the usual layout of a recent iPhone — logic board up top behind the cameras, battery through the middle, charge IC by the port. Real layouts differ by model. Read this as a legend for the list below, not as a map of your phone.
vi: Nhiệt độ được đo thực tế, còn vị trí chỉ mang tính minh họa. iOS báo tên và giá trị cảm biến nhưng không cung cấp tọa độ. Mỗi vùng được vẽ ở vị trí cố định theo bố cục thường gặp của iPhone đời mới: bo mạch ở phía trên, sau camera; pin ở giữa; IC sạc gần cổng. Bố cục thực tế khác nhau theo mẫu máy. Hãy dùng sơ đồ làm chú giải cho danh sách bên dưới, không phải bản đồ chính xác của điện thoại.
zh_hans: 温度数据为实际测量值，但位置并非如此。iOS 仅报告传感器名称和数值，完全不包含坐标信息，因此各发热区域均按近年 iPhone 的常见布局绘制在固定位置 —— 主板位于上方摄像头后部，电池位于中部，充电芯片位于接口旁。不同机型的实际内部布局存在差异。请将此图作为下方列表的图例参考，而非手机内部的真实地图。

source: Thermal
vi: Nhiệt độ
zh_hans: 发热

source: Thermal throttling active
vi: Đang giới hạn do nhiệt
zh_hans: 温控限制已生效

source: This adapter published no PD profile menu. Legacy USB-A chargers and some wireless pads report only a single voltage and current.
vi: Bộ sạc này không công bố danh sách cấu hình PD. Bộ sạc USB-A cũ và một số đế sạc không dây chỉ báo một mức điện áp và dòng điện.
zh_hans: 此适配器未广播 PD 供电规格菜单。传统的 USB-A 充电器和部分无线充电板仅报告单个电压和电流。

source: This charge
vi: Lần sạc này
zh_hans: 本次充电

source: This device
vi: Thiết bị này
zh_hans: 本机

source: This session ended before the first sample was written.
vi: Phiên sạc này kết thúc trước khi mẫu đo đầu tiên được ghi.
zh_hans: 此会话在写入第一个样本前已结束。

source: Those APIs are private, so this build is for sideloading only: it cannot pass App Store review, and any iOS update may change or remove what it reads.
vi: Các API này là riêng tư, nên bản này chỉ có thể cài ngoài App Store: ứng dụng không thể vượt qua kiểm duyệt App Store, và bất kỳ bản cập nhật iOS nào cũng có thể thay đổi hoặc loại bỏ dữ liệu đọc được.
zh_hans: 这些 API 属于私有接口，因此本构建版本仅供侧载使用：它无法通过 App Store 审核，且任何 iOS 系统更新都可能修改或移除其读取的数据。

source: Throttled
vi: Bị giới hạn
zh_hans: 节流

source: Throttling: iOS is limiting charge current and clocks.
vi: Đang giới hạn do nhiệt: iOS đang giảm dòng sạc và xung nhịp.
zh_hans: 发热限频：iOS 正在限制充电电流与芯片频率。

source: Time
vi: Thời gian
zh_hans: 时间

source: Transport
vi: Kiểu kết nối
zh_hans: 连接方式

source: unavailable
vi: không khả dụng
zh_hans: 不可用

source: Unknown
vi: Không rõ
zh_hans: 未知

source: Unknown adapter
vi: Bộ sạc không xác định
zh_hans: 未知适配器

source: Unknown device
vi: Thiết bị không xác định
zh_hans: 未知设备
